Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::v1::TypedCalculationResultColumn< T > Class Template Referenceabstract
MEP Element Manager
Template typed version of the ICalculationResultColumn interface. More...
#include <MEPGraphCalculationInterface.hpp>
 Inheritance diagram for ACAPI::MEP::v1::TypedCalculationResultColumn< T >:
 Public Member Functions
virtual bool  | IsLess (const std::any &value1, const std::any &value2) const override
True if value1 < value2.
virtual bool  | IsEqual (const std::any &value1, const std::any &value2) const override
True if value1 = value2.
 Public Member Functions inherited from ACAPI::MEP::v1::ICalculationResultColumn
 virtual  | ~ICalculationResultColumn ()
Destructor.
virtual GS::UniString  | GetId () const =0
Globally unique ID for this column.
virtual GS::Int32  | GetDefaultWidth () const =0
Starting width of the column to present the calculated data.
virtual GS::UniString  | GetTitle () const =0
Header title for this column without the unit.
virtual std::optional< GS::UniString >  | GetUnitToDisplay (MeasurementSystem system) const =0
Unit to display in the column's header title.
virtual GS::UniString  | FormatValueToDisplayText (const std::any &value, MeasurementSystem system) const =0
Formats the value to a displayable text.
virtual bool  | IsLess (const std::any &value1, const std::any &value2) const =0
True if value1 < value2.
virtual bool  | IsEqual (const std::any &value1, const std::any &value2) const =0
True if value1 = value2.
 Protected Member Functions
virtual GS::UniString  | FormatValueToDisplayText (const T &value, MeasurementSystem system) const =0
Formats the value to a displayable text.
Detailed Description
template<typename T>
 class ACAPI::MEP::v1::TypedCalculationResultColumn< T >
Template typed version of the ICalculationResultColumn interface.
Since
Archicad 28
Member Function Documentation
◆ FormatValueToDisplayText()
 template<typename T >
 virtual GS::UniString ACAPI::MEP::v1::TypedCalculationResultColumn< T >::FormatValueToDisplayText  |  ( |  const T &  |  value,
|  MeasurementSystem  |  system
) |   |  const
protectedpure virtual
Formats the value to a displayable text.
Parameters
value | The typed value to format into a displayable text
system | The measurement system in which the displayed text is interpeted
Returns
The displayable text
◆ IsEqual()
 template<typename T >
 virtual bool ACAPI::MEP::v1::TypedCalculationResultColumn< T >::IsEqual  |  ( |  const std::any &  |  value1,
|  const std::any &  |  value2
) |   |  const
inlineoverridevirtual
True if value1 = value2.
Parameters
value1 | first value that is checked if it equals to the second value
value2 | second value
Returns
True if value1 equals to value2
Implements ACAPI::MEP::v1::ICalculationResultColumn.
◆ IsLess()
 template<typename T >
 virtual bool ACAPI::MEP::v1::TypedCalculationResultColumn< T >::IsLess  |  ( |  const std::any &  |  value1,
|  const std::any &  |  value2
) |   |  const
inlineoverridevirtual
True if value1 < value2.
Parameters
value1 | first value that is checked if it is less than the second value
value2 | second value
Returns
True if value1 is less than value2
Implements ACAPI::MEP::v1::ICalculationResultColumn.